#Использовать asserts

&ПередКаждым
Процедура ПередКаждым() Экспорт
КонецПроцедуры

&ПослеКаждого
Процедура ПослеКаждого() Экспорт
КонецПроцедуры

&ПовторяемыйТест(3)
Процедура ТриРаза() Экспорт
КонецПроцедуры

&ПовторяемыйТест(3, Имя = "{ОтображаемоеИмя} №{ТекущееПовторение}")
Процедура ТриРазаИменной() Экспорт
КонецПроцедуры

&ПовторяемыйТест(3, Имя = "{ОтображаемоеИмя} №{ТекущееПовторение}")
&ОтображаемоеИмя("Я именованный")
&Тег("ОтображаемоеИмя")
Процедура ТриРазаИменнойИменованный() Экспорт
КонецПроцедуры

&ТестовыйНабор
&Порядок(7)
&Тег("Повторяемый")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
